# vsoContextM_AddN

## Description
Add an item to the context menu of the object during ObjectContextMenuEvent::kAction_Init event.

```pascal
PROCEDURE vsoContextM_AddN(
				locName : STRING;
				itemID  : INTEGER;
				helpID  : STRING;
				helpStr : STRING);
```

```python

def vs.vsoContextM_AddN(locName, itemID, helpID, helpStr):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|locName|STRING||
|itemID|INTEGER||
|helpID|STRING||
|helpStr|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* Object Events